export type Question = {
  id: number;
  text: string;
  options?: string[];
  correctAnswer?: string;
  imageURL?: string;
  type: string;
  intro?: {
    text: string;
    imageURL?: string;
    type: string;
  }
};

export const questions: Question[] = [
  {
    id: 1,
    text: "نجم البحر لا يشكل غذاء لأي مفترس بحري بسبب ...",
    options: ["مصباح ارسطو", "الجلد الشوكي", "الطعم المر", "اللوامس المخاطية"],
    correctAnswer: "الجلد الشوكي",
    type: "question",
    intro: {
        text: "الدرس الاول - خصائص شوكيات الجلد",
        type: "intro",
        imageURL: "/assets/photos/خصائص_شوكيات_الجلد.jpg"
    }
  },
  {
    id: 2,
    text: "انابيب صغيرة عضلية تساعد على الالتصاق بالسطوح والحركة وجمع الغذاء والتنفس في شوكيات الجلد ..",
    options: [
      "الحويصلات العضلية",
      "الخياشيم الجلدية",
      "اللواقط القديمة",
      "الاقدام الأنبوبية",
    ],
    correctAnswer: "الاقدام الأنبوبية",
    type: "question",
  },
  {
    id: 3,
    text: "حيوانات بحرية لها جهاز وعائي مائي وأقدام انبوبية ...",
    options: ["شوكيات الجلد", "القشريات", "الاسماك", "الحبليات"],
    correctAnswer: "شوكيات الجلد",
    type: "question",
  },
  {
    id: 4,
    text: "ما سبب نقص أعداد المحار والمرجان ؟",
    options: ["زنابق البحر", "دولار الرمل", "نجم البحر", "قنفذ البحر"],
    correctAnswer: "نجم البحر",
    type: "question",
  },
  {
    id: 5,
    text: "تركيب خاص بتبادل الغازات عند خيار البحر ؟",
    options: [
      "الخياشيم الجلديه",
      "الشجرة التنفسية",
      "القصبات الهوائية",
      "الرئات الكتبية",
    ],
    correctAnswer: "الشجرة التنفسية",
    type: "question",
  },
  {
    id: 6,
    text: "سبب نقص أعشاب البحر ...",
    options: [
      "قلة ثعالب البحر وزيادة قنافذ البحر",
      "زيادة ثعالب البحر وقلة قنافذ البحر",
      "قلة كل من ثعالب البحر و قنافذ البحر",
      "زيادة كل من ثعالب البحر وقنافذ البحر",
    ],
    correctAnswer: "قلة ثعالب البحر وزيادة قنافذ البحر",
    type: "question",
  },
  {
    id: 7,
    text: "أي العبارات التالية صحيح ؟",
    options: [
      "النجميات مثل نجم البحر له خمس أذرع ولا يمتلك أقدام انبوبية",
      "الزنبقيات مثل زنابق البحر ليس لها أذرع و لها أقدام انبوبية",
      "القثائيات مثل خيار البحر ليس له أذرع وليس له أقدام انبوبية",
      "القنفذيات مثل قنفذ البحر ليس له أذرع وله أقدام أنبوبية",
    ],
    correctAnswer: "القنفذيات مثل قنفذ البحر ليس له أذرع وله أقدام أنبوبية",
    type: "question",
  },
  {
    id: 8,
    text: "إذا انقسم نجم البحر إلى نصفين ماذا يحصل له ...",
    options: [
      "يتحلل",
      "يندمجان مع بعض",
      "ينمو كل قسم إلى حيوان آخر",
      "تتكون رسوبيات",
    ],
    correctAnswer: "ينمو كل قسم إلى حيوان آخر",
    type: "question",
  },
  {
    id: 9,
    text: "تتنفس شوكيات الجلد بكل الطرق التالية ما عدا ...",
    options: [
      "الخياشيم الجلدية",
      "المصفاة",
      "الأقدام الانبوبية",
      "أغشية الجسم الرقيقة",
    ],
    correctAnswer: "المصفاة",
    type: "question",
  },
  {
    id: 10,
    text: "أي المخلوقات التالية تتوقع وجود أقدام انبوبية فيها ؟",
    options: ["السهيم", "الخنافس", "القرش", "قنفذ البحر"],
    correctAnswer: "قنفذ البحر",
    type: "question",
  },
  {
    id: 11,
    text: "ما المصطلحات الأكثر تقاربا فيما يلي ؟",
    options: [
      "الأقدام الأنبوبية - الإحساس",
      "اللواقط القديمة - الحركة",
      "مصباح ارسطوا - قنفذ البحر",
      "الأذرع الخمسة - خيار البحر",
    ],
    correctAnswer: "مصباح ارسطوا - قنفذ البحر",
    type: "question",
  },
  {
    id: 12,
    text: "أي العبارات التالية صحيحة عن شوكيات الجلد ؟",
    options: [
      "طائفة النجميات مثل حيوان نجم البحر له خمسة أذرع وأقدام انبوبية",
      "طائفة الزنبقيات مثل نجم البحر الريشي ليس له أذرع وله أقدام انبوبية",
      "طائفة القثائيات مثل خيار البحر له أذرع وليس له أقدام انبوبية",
      "طائفة القنفذيات مثل قنفذ البحر له أذرع وليس له أقدام انبوبية",
    ],
    correctAnswer:
      "طائفة النجميات مثل حيوان نجم البحر له خمسة أذرع وأقدام انبوبية",
    type: "question",
  },
  {
    id: 13,
    text: "يتم تبادل الغازات في خيار البحر بواسطة ..",
    options: [
      "القصبات الهوائية",
      "الرئات الكتبية",
      "الأقدام الأنبوبية",
      "الشجرة التنفسية",
    ],
    correctAnswer: "الشجرة التنفسية",
    type: "question",
  },
  {
    id: 14,
    text: "أي مما يلي يحتوي على أجهزة مضغ ؟",
    options: ["الاسفنج", "قنفذ البحر", "خيار البحر", "نجم البحر"],
    correctAnswer: "قنفذ البحر",
    type: "question",
  },
  {
    id: 15,
    text: "أي التراكيب التالية مسؤول عن دخول الماء إلى الجهاز الوعائي المائي في شوكيات الجلد ؟",
    options: ["القدم الأنبوبية", "المصفاة", "الشرج", "اللواقط القديمة"],
    correctAnswer: "المصفاة",
    type: "question",
  },
  {
    id: 16,
    text: "ما نوع التناظر الذي يميز يرقة نجم البحر الهش ؟",
    options: ["شعاعي", "عديمة التناظر", "جانبي", "دائري"],
    correctAnswer: "جانبي",
    type: "question",
  },
  {
    id: 17,
    text: "أي طائفة من طوائف شوكيات الجلد تتميز بجسم كروي أو قرصي مغطى بهيكل داخلي صلب (القشرة) وأشواك ؟",
    options: ["النجميات", "الزنبقيات", "القثائيات", "القنفذيات"],
    correctAnswer: "القنفذيات",
    type: "question",
  },
  {
    id: 18,
    text: "عندما تنقبض الحويصلة العضلية ماذا يحدث في نهاية القدم الأنبوبية ؟",
    options: [
      "ينسحب الماء من القدم الأنبوبية فتنكمش",
      "يخرج الماء من المصفاة",
      "يتوقف تدفق الماء تماما",
      "يندفع الماء إلى القدم الأنبوبية فتتمدد للخارج",
    ],
    correctAnswer: "ينسحب الماء من القدم الأنبوبية فتنكمش",
    type: "question",
  },
  {
    id: 19,
    text: "أي مما يلي لا يعد من الوظائف الرئيسية الاقدام الأنبوبية في شوكيات الجلد ؟",
    options: ["الحركة", "التنفس", "الحصول على الغذاء", "التكاثر الجنسي"],
    correctAnswer: "التكاثر الجنسي",
    type: "question",
  },
  {
    id: 20,
    text: "تعتبر شوكيات الجلد من الحيوانات بدائية الفم ، حيث يتكون من الفم من فتحة الجاسترولا ؟",
    options: ["صح", "خطأ"],
    correctAnswer: "خطأ",
    type: "question",
  },
  {
    id: 21,
    text: "يساعد التناظر الشعاعي في الحيوانات البالغة البطيئة الحركة على الإحساس بالبيئة من جميع الاتجاهات بكفاءة",
    options: ["صح", "خطأ"],
    correctAnswer: "صح",
    type: "question",
  },
  {
    id: 22,
    text: "يتكون الهيكل الداخلي في شوكيات الجلد بشكل أساسي من صفائح من كربونات الكالسيوم",
    options: ["صح", "خطأ"],
    correctAnswer: "صح",
    type: "question",
  },
  {
    id: 23,
    text: "يتميز نجم البحر الهش من طائفة الثعبانيات بأذرع مرنة يستخدمها في الحركة السريعة الشبيهة بحركة الثعابين",
    options: ["صح", "خطأ"],
    correctAnswer: "صح",
    type: "question",
  },
  {
    id: 24,
    text: "تتكاثر أغلب شوكيات الجلد تكاثر جنسي عن طريق الاخصاب الداخلي داخل جسم الانثى",
    options: ["صح", "خطأ"],
    correctAnswer: "خطأ",
    type: "question",
  },
  {
    id: 25,
    text: "من اللافقاريات الحبلية ؟",
    options: ["السهيم", "دودة الأرض", "زنابق البحر", "الاخطبوط"],
    correctAnswer: "السهيم",
    type: "question",
    intro: {
        text: "الدرس الثاني - اللافقاريات الحبلية",
        type: "intro",
        imageURL: "/assets/photos/اللافقاريات_الحبلية.jpg"
    }
  },
  {
    id: 26,
    text: "ما الوظيفة الرئيسة للذيل خلف الشرجي ؟",
    options: ["الدوران", "الهضم", "الحركة", "المرونة"],
    correctAnswer: "الحركة",
    type: "question",
  },
  {
    id: 27,
    text: "أي مما يلي حيوان شفاف يدفن نفسه في الرمل ؟",
    options: ["النحل", "السهيم", "الكيسيات", "دولار الرمل"],
    correctAnswer: "السهيم",
    type: "question",
  },
  {
    id: 28,
    text: "ماذا تفرز القناة الداخلية في اللافقاريات الحبلية ؟",
    options: [
      "المخاط",
      "بروتينات مماثلة لهرمونات الغدة الدرقية",
      "بخ الماء",
      "سم",
    ],
    correctAnswer: "بروتينات مماثلة لهرمونات الغدة الدرقية",
    type: "question",
  },
  {
    id: 29,
    text: "أي التراكيب تتحول إلى دماغ وحبل شوكي في أغلب الحبليات ؟",
    options: [
      "الحبل العصبي",
      "الحبل الظهري",
      "الذيل الخلف شرجي",
      "الجيوب البلعومية",
    ],
    correctAnswer: "الحبل العصبي",
    type: "question",
  },
  {
    id: 30,
    text: "اي مما يلي يوجد في الحبليات خلال فترة من حياتها؟",
    options: [
      "جهاز وعائي مائي و حبل ظهري وجيوب بلعومية وذيل خلف شرجي",
      "قميص و جيوب بلعومية وحبل شوكي وذيل خلف شرجي",
      "أقدام انبوبية وحبل ظهري و جيوب بلعومية و ذيل خلف شرجي",
      "حبل ظهري و حبل عصبي وجيوب بلعومية وذيل خلف شرجي",
    ],
    correctAnswer: "حبل ظهري و حبل عصبي وجيوب بلعومية وذيل خلف شرجي",
    type: "question",
  },
  {
    id: 31,
    text: "أي الصفات الآتية ينطبق على بخاخات البحر البالغ",
    options: [
      "لها تناظر جانبي",
      "لها مظهر السهيم البالغ",
      "لها صفة واحدة فقط من صفات الحبليات بوصفها حيوانات بالغه",
      "حيوانات مفترسة ونشيط في السباحة",
    ],
    correctAnswer: "لها صفة واحدة فقط من صفات الحبليات بوصفها حيوانات بالغه",
    type: "question",
  },
  {
    id: 32,
    text: "تشترك الحبليات اللافقارية وشوكيات الجلد في ...",
    options: [
      "الجيوب البلعومية والغدة الدرقية",
      "حيوانات بحرية ثانوية الفم",
      "التجويف الجسمي الكاذب والهيكل الخارجي",
      "بدائية الفم و تعد حيوانات مائية",
    ],
    correctAnswer: "حيوانات بحرية ثانوية الفم",
    type: "question",
  },
  {
    id: 33,
    text: "في اللافقاريات الحبلية تصبح السباحة ممكنه بسبب ...",
    options: [
      "الحبل العصبي",
      "الحبل الظهري",
      "الجيوب البلعومية",
      "الغدة الدرقية",
    ],
    correctAnswer: "الحبل الظهري",
    type: "question",
  },
  {
    id: 34,
    text: "أي التراكيب التالية يوجد في جميع الحبليات خلال فترة من حياتها ويستخدم أساسا الدعامة",
    options: ["العمود الفقري", "الحبل الظهري", "الخياشيم", "الزوائد القديمة"],
    correctAnswer: "الحبل الظهري",
    type: "question",
  },
  {
    id: 35,
    text: "ما الصفة التي تميز يرقة الكيسيات عن الحيوان البالغ",
    options: [
      "التغذيه الترشيحية",
      "القدرة على بخ الماء",
      "وجود ذيل خلف شرجي وحبل ظهري",
      "الجسم المغطى بالقميص",
    ],
    correctAnswer: "وجود ذيل خلف شرجي وحبل ظهري",
    type: "question",
  },
  {
    id: 36,
    text: "تتشابه اللافقاريات الحبلية مع شوكيات الجلد في كونها",
    options: [
      "ذات تناظر شعاعي",
      "أولية الفم",
      "عديمة التجويف الجسمي",
      "ثانوية الفم",
    ],
    correctAnswer: "ثانوية الفم",
    type: "question",
  },
  {
    id: 37,
    text: "ما الوظيفة الأساسية اللجيوب البلعومية في حيوان السهيم ؟",
    options: ["الهضم", "ترشيح الغذاء", "الإحساس بالبيئة", "إنتاج الأمشاج"],
    correctAnswer: "ترشيح الغذاء",
    type: "question",
  },
  {
    id: 38,
    text: "يتميز الحبل العصبي في الحبليات عن غيرها من الحيوانات بأنه :",
    options: ["بطني ومصمت", "ظهري وانبوبي", "جانبي ومتفرع", "بطني وانبوبي"],
    correctAnswer: "ظهري وانبوبي",
    type: "question",
  },
  {
    id: 39,
    text: "جميع الحيوانات التي تنتمي لشعبة الحبليات تمتلك عمودا فقريا",
    options: ["صح", "خطأ"],
    correctAnswer: "خطأ",
    type: "question",
  },
  {
    id: 40,
    text: "يحتفظ حيوان السهيم بجميع الصفات الأربع المميزة للحبليات في مرحلة البلوغ",
    options: ["صح", "خطأ"],
    correctAnswer: "صح",
    type: "question",
  },
  {
    id: 41,
    text: "في الفقاريات ، يحل العمود الفقري محل الحبل الظهري أثناء النمو الجنيني",
    options: ["صح", "خطأ"],
    correctAnswer: "صح",
    type: "question",
  },
  {
    id: 42,
    text: "تتكيف الكيسيات البالغة للحياة جالسة وتفقد قدرتها على السباحة",
    options: ["صح", "خطأ"],
    correctAnswer: "صح",
    type: "question",
  },
  {
    id: 43,
    text: "يقع الحبل العصبي في الحبليات في الجهة البطنية من الجسم",
    options: ["صح", "خطأ"],
    correctAnswer: "خطأ",
    type: "question",
  },
];
