export type Question = {
    id: number
    text: string
    options: string[]
    correctAnswer: string
    imageURL?: string

}

export const questions: Question[] = [
    {
        id: 1,
        text: "وجود مخلوقات حية تتزاوج فيما بينها في مكان واحد في وقت ما هي ...",
        options: ["النظام البيئي", "المجتمع الحيوي", "علم البيئة", "الجماعة الحيوية"],
        correctAnswer: "الجماعة الحيوية"
    },
    {
        id: 2,
        text: "علاقة مخلوقين حيين يستفيد كلاهما من الآخر تسمى ...",
        options: ["افتراس", "تنافس", "تقايض", "تطفل"],
        correctAnswer: "تقايض"
    },
    {
        id: 3,
        text: "أي مستويات التنظيم البيئي الآتية تحتوي على أقل عدد من المخلوقات الحية ؟",
        options: ["النظام البيئي", "الجماعة الحيوية", "المجتمع الحيوي", "المنطقة الحيوية"],
        correctAnswer: "الجماعة الحيوية"
    },
    {
        id: 4,
        text: "ابسط مستويات التنظيم البيئي ..",
        options: ["المجتمع الحيوي", "المخلوق الحي", "الجماعة الحيوية", "النظام البيئي"],
        correctAnswer: "المخلوق الحي"
    },
    {
        id: 5,
        text: "ما المصطلح المناسب لوصف دور النحلة في جمع حبوب اللقاح ؟",
        options: ["تطفل", "افتراس", "موطن بيئي", "إطار بيئي"],
        correctAnswer: "إطار بيئي"
    },
    {
        id: 6,
        text: "ما الذي يحدث عندما يستخدم أكثر من مخلوق حي واحد المصادر نفسها في الوقت نفسه ؟",
        options: ["تعايش", "تقايض", "تنافس", "تطفل"],
        correctAnswer: "تنافس"
    },
    {
        id: 7,
        text: "أي من العوامل التالية لا يعد عامل حيوي يجعل المخلوق الحي يدخل إلى جحره أثناء البيات الشتوي ؟",
        options: ["قلة النباتات", "قلة الحيوانات", "زيادة المفترسات", "انخفاض درجة الحرارة"],
        correctAnswer: "انخفاض درجة الحرارة"
    },
    {
        id: 8,
        text: "العلاقة بين النحلة والزهرة تعد علاقة ...",
        options: ["تقايض", "تعايش", "تطفل", "تنافس"],
        correctAnswer: "تقايض"
    },
    {
        id: 9,
        text: "مجموعة واسعة من الأنظمة البيئية التي تشترك في المناخ نفسه تسمى ...",
        options: ["نظام بيئي", "مجتمع حيوي", "الغلاف الحيوي", "المنطقة الحيوية"],
        correctAnswer: "المنطقة الحيوية"
    },
    {
        id: 10,
        text: "في العلاقة التكافلية بين الفطريات والطحالب في الأشنات تزود الطحالب الأشنات ب ..",
        options: ["الماء", "الأملاح المعدنية", "ثاني أكسيد الكربون", "الغذاء"],
        correctAnswer: "الغذاء"
    },
    {
        id: 11,
        text: "تجمع الحشرة حبوب اللقاح والرحيق من أجل غذائها ولكنها في الوقت نفسه تساعد على تكاثر النبات .. هذه علاقة ...",
        options: ["تطفل", "تقايض", "افتراس", "تعايش"],
        correctAnswer: "تقايض"
    },
    {
        id: 12,
        text: "ما العلاقة بين الفطر والطحلب في الأشنات ؟",
        options: ["تكافلية", "تطفلية", "تنافسية", "افتراسية"],
        correctAnswer: "تكافلية"
    },
    {
        id: 13,
        text: "من العوامل اللاحيوية التي تقلل الأعشاب ...",
        options: ["ٱكلات الأعشاب", "آكلات اللحوم", "كثرة نمو الفطريات", "الأمطار الموسمية"],
        correctAnswer: "الأمطار الموسمية"
    },
    {
        id: 14,
        text: "علاقة القراد بجلد الجمل تسمى ...",
        options: ["تطفل", "تعايش", "تقايض", "تنافس"],
        correctAnswer: "تطفل"
    },
    {
        id: 15,
        text: "جميع ما يلي عوامل حيوية تؤثر في المناطق الصحراوية ما عدا ..",
        options: ["تناقص نمو الأعشاب", "قلة سقوط الأمطار الموسمية", "زيادة أعداد الحيوانات المفترسة", "زيادة أعداد الحيوانات ٱكلات تلأعشاب"],
        correctAnswer: "زيادة أعداد الحيوانات المفترسة"
    },
    {
        id: 16,
        text: "الكتلة الإجمالية للمادة الحيوية عند كل مستوى غذائي ...",
        options: ["الكتلة الحيوية", "السلسلة الغذائية", "الشبكة الغذائية", "الهرم الغذائي"],
        correctAnswer: "الكتلة الحيوية"
    },
    {
        id: 17,
        text: "ما هي أهم المخلوقات في البيئة ؟",
        options: ["الكانسات", "غير ذاتية التغذية", "المحللات", "ذاتية التغذية"],
        correctAnswer: "ذاتية التغذية"
    },
    {
        id: 18,
        text: "ماذا تسمى المخلوقات التي تتغذى على بقايا الحيوانات ؟",
        options: ["المفترسة", "المحللة", "المتطفلة", "الكانسة"],
        correctAnswer: "المحللة"
    },
    {
        id: 19,
        text: "ما نوع المخلوق الحي غير ذاتي التغذي الذي يصف الأفعى وصفا مناسبا ؟",
        options: ["قارت", "ٱكل أعشاب", "ٱكل لحوم", "كانس"],
        correctAnswer: "ٱكل لحوم"
    },
    {
        id: 20,
        text: "أي أجزاء الشبكة الغذائية التالية يحوي أكبر كتلة حيوية ؟",
        options: ["النباتات الخضراء", "الثعالب", "الفئران", "الأرنب"],
        correctAnswer: "النباتات الخضراء"
    },
    {
        id: 21,
        text: "المخلوقات التي توفر الطاقة والغذاء لجميع المخلوقات الحية هي ...",
        options: ["المحللة", "الذاتية", "الكانسة", "القارتة"],
        correctAnswer: "الذاتية"
    },
    {
        id: 22,
        text: "تسمى المخلوقات الحية التي تتغذى على المخلوقات الميتة والمخلوقات العضوية ...",
        options: ["المفترسات", "الذاتية", "المحللات", "القارتة"],
        correctAnswer: "المحللات"
    },
    {
        id: 23,
        text: "أي المخلوقات الحية في النظام البيئي تشكل جزء مهم من دورة الحياة بسبب توفيرها المواد المغذية لكل المخلوقات الحية الأخرى ؟",
        options: ["المحللة", "القارتة", "ٱكلات اللحوم", "الذاتية"],
        correctAnswer: "الذاتية"
    },
    {
        id: 24,
        text: "يدخل الكربون والأكسجين ضمن عمليتين حيويتين رئيسيتين هما ...",
        options: ["احتراق الوقود واحتراق الغابات", "البناء الضوئي والتنفس", "تكوين الفحم والبناء الضوئي", "الموت والتحلل"],
        correctAnswer: "البناء الضوئي والتنفس"
    },
    {
        id: 25,
        text: "ترجع أهمية الدورات الجيوكيميائية الحيوية في البيئة إلى ...",
        options: ["توفير المواد المغذية", "التخلص من الملوثات", "تحريك المواد في البيئة", "توفير الأكسجين فقط"],
        correctAnswer: "التخلص من الملوثات"
    },
    {
        id: 26,
        text: "تبين لمزارع أن حقله فقير بأحد العناصر الأساسية الكبرى ، فاقترح عليه مهندس زراعي بزراعة بقوليات خلال هذا الموسم لاستصلاح الأرض في حقله فمن المحتمل أن يكون هذا العنصر هو ...",
        options: ["كربون", "فسفور", "نيتروجبن", "بوتاسيوم"],
        correctAnswer: "نيتروجبن"
    },
    {
        id: 27,
        text: "يوجد أعلى تركيز من النيتروجين في ...",
        options: ["الحيوانات", "الغلاف الجوي", "النباتات", "البكتيريا"],
        correctAnswer: "الغلاف الجوي"
    },
    {
        id: 28,
        text: "ما العملية التي تحبس الفوسفور في الدورة طويلة الأمد ؟",
        options: ["طرح النباتات والحيوانات لفضلاتها", "انتقال الفوسفات إلى التربة", "دفن المادة العضوية في قاع المحيطات", "تعرية الجبال بالامطار"],
        correctAnswer: "دفن المادة العضوية في قاع المحيطات"
    },
    {
        id: 29,
        text: "أي المناطق الحيوية البرية الٱتية تحوي أكبر تنوع حيوي",
        options: ["الغابات الاستوائية المطيرة", "الحشائش", "التندرا", "الصحراء"],
        correctAnswer: "الغابات الاستوائية المطيرة"
    },
    {
        id: 30,
        text: "أي مما يلي يسبب تناقص في طبقة الأوزون في الغلاف الجوي (يؤثر على المناخ)؟",
        options: ["ثاني أكسيد الكربون", "أكسيد النيتروجين", "أكسيد الكبريت", "الكلوروفلوروكربون"],
        correctAnswer: "الكلوروفلوروكربون"
    },
    {
        id: 31,
        text: "أي مما يلي من الأنواع الرائدة في التعاقب الأولي",
        options: ["حقل حشائش تعرض لكارثة", "بركان حديث الكوين", "شعاب مرجانية", "مجتمع ذروة غابة"],
        correctAnswer: "بركان حديث الكوين"
    },
    {
        id: 32,
        text: "المنطقة الحيوية الأكثر تواجدا في المملكة العربية السعودية (يزيد فيها معدل التبخر السنوي على معدل الأمطار)؟",
        options: ["السافانا", "الغابات المعتدلة", "منطقة الصحاري", "الغابات الشمالية"],
        correctAnswer: "منطقة الصحاري"
    },
    {
        id: 33,
        text: "قدرة المخلوق الحي على العيش في ظروف أخرى لعامل محدد تسمى ...",
        options: ["التوزيع", "مدى التحمل", "التعاقب البيئي", "مجتمع الذروة"],
        correctAnswer: "مدى التحمل"
    },
    {
        id: 34,
        text: "منطقة توجد في شمال الكرة الأرضية و ذات تربة متجمدة وخالية من الأشجار هي ...",
        options: ["التندرا", "المناطق الاستوائية", "المناطق الحرجية", "الغابات الاستوائية المطيرة"],
        correctAnswer: "التندرا"
    },
    {
        id: 35,
        text: "عندما يقلل نقص عنصرا ما من عدد الجماعة الحيوية فإننا نطلق على هذا العامل بالعامل ....",
        options: ["التحمل", "التوزيع", "المحدد", "الحيوي"],
        correctAnswer: "المحدد"
    },
    {
        id: 36,
        text: "المجتمع الحيوي المستقر الذي ينتج عندما يكون هناك تغير طفيف في عدد الأنواع هو ...",
        options: ["تعاقب أولي", "تعاقب ثانوي", "نهاية تعاقب", "مجتمع ذروة"],
        correctAnswer: "مجتمع ذروة"
    },
    {
        id: 37,
        text: "قدرة المخلوق الحي على البقاء ومقاومة عائل بعينه تسمى ...",
        options: ["استجابة", "التعاقب الأولي", "التحمل", "نوع رائد"],
        correctAnswer: "التحمل"
    },
    {
        id: 38,
        text: "منطقة الغابة التي تشهد تغيرا طفيفا جدا في الأنواع هو ...",
        options: ["مجتمع ذروة", "تعاقب أولي", "الأنواع الرائدة", "تعاقب ثانوي"],
        correctAnswer: "مجتمع ذروة"
    },
    {
        id: 39,
        text: "كمية الأكسجين في حوض الأسماك الذي يؤثر عدد الأسماك التي تستطيع العيش في الحوض هو ...",
        options: ["منطقة التحمل", "العامل المحدد", "العامل الحيوي", "منطقة الإجهاد الفيسيلوجي"],
        correctAnswer: "العامل المحدد"
    },
    {
        id: 40,
        text: "التغيرات التي تحدث على سفح جبل تعرض لانزلاق طيني مدمر  يسمى ...",
        options: ["تعاقب أولي", "تعاقب ثانوي", "مجتمع ذروة", "عامل محدد"],
        correctAnswer: "تعاقب ثانوي"
    },
    {
        id: 41,
        text: "الوصف الأفضل للمجتمعات الحيوية على جبل مرتفع ؟",
        options: ["غابات دائمة الخضرة", "تترتب عدة مجتمعات حيوي. بحسب الارتفاع", "مجتمع حيوي متشابه", "مجتمعات حيوية تشبه مجتمعات التندرا"],
        correctAnswer: "تترتب عدة مجتمعات حيوي. بحسب الارتفاع"
    },
    {
        id: 42,
        text: "أي التكيفات تساعد النبات على العيش في منطقة التندرا الحيوية ؟",
        options: ["أوراق متساقطة في الشتاء", "أوراق تخزن الماء", "جذور بعمق سنتمترات قليلة", "سيقان تحت أرصية"],
        correctAnswer: "جذور بعمق سنتمترات قليلة"
    },
    {
        id: 43,
        text: "تتجانس مياه البركة من حيث توزيع الأكسجين والغذاء على طبقاتها في فصل الربيع أكثر من ها في فصل الشتاء بسبب ...",
        options: ["الأمطار الغزيرة", "حركة الرياح", "نشاط المخلوقات الحية في البركة", "درجة الحرارة"],
        correctAnswer: "نشاط المخلوقات الحية في البركة"
    },
    {
        id: 44,
        text: "أي المناطق التالية تحوي تنوعا كبيرا من العوالق ؟",
        options: ["المنطقة المظلمة", "المنطقة المضيئة", "منطقة اللجنة", "منطقة الشاطىء"],
        correctAnswer: "المنطقة المضيئة"
    },
    {
        id: 45,
        text: "أي التكيفات التي تتوقع وجودها في مخلوق حي يعيش في منطقة المد والجزر ؟",
        options: ["القدرة على العيش في الظلمة التامة", "القدرة على العيش في الماء البارد", "القدرة على العيش في الماء المتحرك", "القدرة على العيش بدون ماء لمدة ٢٤ ساعة"],
        correctAnswer: "القدرة على العيش في الماء المتحرك"
    },
    {
        id: 46,
        text: "أي مناطق المحيط الٱتية لا تتمكن المخلوقات الحية التي تنتج غذائها بنفسها أن تعيش فيها ؟",
        options: ["المظلمة", "المضيئة", "الشاطىء", "المد والجزر"],
        correctAnswer: "المظلمة"
    },
    {
        id: 47,
        text: "اين توجد أكبر نسبة الماء ؟",
        options: ["المياه الجوفية", "المحيطات", "الجبال الجليدية", "الأنهار"],
        correctAnswer: "المحيطات"
    },
    {
        id: 48,
        text: "ما نمط توزيع حيوانات تعيش على صورة قطيع ؟",
        options: ["تكتلي", "منتظم", "عشوائي", "فردي"],
        correctAnswer: "تكتلي"
    },
    {
        id: 49,
        text: "إذا أنتج السمك البلطي مئات الصغار عدة مرات في السنة فأي مما يلي صحيح حول هذا النوع من السمك ؟",
        options: ["معدل وفيات قليل", "يتكاثر بنمط استراتيجية المعدل", "يعتني بصغاره", "يتكاثر بنمط استراتيجية القدرة الاستيعابية"],
        correctAnswer: "يتكاثر بنمط استراتيجية المعدل"
    },
    {
        id: 50,
        text: "أي العوامل المحددة التالية تعتمد على كثافة الجماعة وتؤثر في نمو الجماعة؟",
        options: ["انتشار حرائق الغابات (الحروب)", "ضخ الفضلات السامة للنهر", "الأمطار الغزيرة والفيضانات", "فيروس معدي وقاتل"],
        correctAnswer: "الأمطار الغزيرة والفيضانات"
    },
    {
        id: 51,
        text: "دخول أفراد إلى الجماعة هو ..",
        options: ["القدرة الاستيعابية", "الهجرة الداخلية", "كثافة الجماعة", "الهجرة الخارجية"],
        correctAnswer: "الهجرة الداخلية"
    },
    {
        id: 52,
        text: "عدد المخلوقات الحية لكل وحدة مساحة هو ...",
        options: ["كثافة الجماعة", "توزيع الجماعة", "معدل نمو الجماعة", "القدرة الاستيعابية"],
        correctAnswer: "كثافة الجماعة"
    },
    {
        id: 53,
        text: "التغير في الجماعة من معدل ولادات ووفيات عال إلى معدل ولادات ووفيات منخفض يطلق عليه",
        options: ["النمو الصفري للجماعة", "كثافة الجماعة", "التحول السكاني", "التركيب العمري"],
        correctAnswer: "التحول السكاني"
    },
    {
        id: 54,
        text: "أكبر عدد ممكن من الأنواع تستطيع البيئة دعمه ومساعدته في العيش لأطول فترة ممكنة يسمى ...",
        options: ["التعاقب الأولي", "مدى التحمل", "التعاقب الثانوي", "القدرة الاستيعابية"],
        correctAnswer: "القدرة الاستيعابية"
    },
    {
        id: 55,
        text: "علم يختص بدراسة حجم الجماعات البشرية وكثافتها وتوزيعها ...",
        options: ["علم الأرض", "علم الكيمياء", "علم الطبيعة", "علم السكان الإحصائي (الديموغرافيا)"],
        correctAnswer: "علم السكان الإحصائي (الديموغرافيا)"
    },
    {
        id: 56,
        text: "في الشكل أعلاه المنحنى رقم 4 يمثل ...",
        options: ["القدرة الاستيعابية", "النمو النسبي", "تجاوز القدرة الاستيعابية", "طور التباطؤ"],
        correctAnswer: "تجاوز القدرة الاستيعابية",
        imageURL: "/assets/photos/photo_3@25-01-2025_19-28-48.jpg"
    },
    {
        id: 57,
        text: "الشكل أعلاه يمثل أي نوع من أنواع التوزيع؟",
        options: ["منتظم", "تكتلي", "عشوائي", "تنازلي"],
        correctAnswer: "منتظم",
        imageURL: "/assets/photos/photo_4@25-01-2025_19-34-32.jpg"
    },
    {
        id: 58,
        text: "الشكل أعلاه يمثل نمو جماعة حيوية؛ أي الخيارات التالية يمثل طور التباطؤ",
        options: ["1", "2", "3", "4"],
        correctAnswer: "2",
        imageURL: "/assets/photos/photo_5@25-01-2025_19-39-51.jpg"
    },
    {
        id: 59,
        text: "أي العوامل التالية لا يعتمد على أفراد الجماعة؟",
        options: ["الطفيليات", "التنافس", "المرض", "الفيضانات (الجفاف الحاد)"],
        correctAnswer: "الفيضانات (الجفاف الحاد)"
    },
    {
        id: 60,
        text: "أي مما يأتي أقرب ما يمكن إلى بحيرة قليلة التغذي؟",
        options: ["البحيرة التي يؤدي فيها إزهار الطحالب إلى موت الأسماك", "البحيرة المتكونة بالقرب من مصب النهر", "البحيرة المتكونة عند فوهة بركان", "البحيرة الناتجة عن تعرج النهر"],
        correctAnswer: "البحيرة المتكونة عند فوهة بركان"
    },
    {
        id: 61,
        text: "في الشكل أعلاه، ما الرقم الذي يدل على القدرة الاستيعابية للموطن؟",
        options: ["1", "2", "3", "4"],
        correctAnswer: "2",
        imageURL: "/assets/photos/photo_6@25-01-2025_20-36-30.jpg"
    },
    {
        id: 62,
        text: "في الشكل اعلاه، أي أجزاء المخطط تشير إلى النمو الأسي؟",
        options: ["1", "2", "3", "4"],
        correctAnswer: "2",
        imageURL: "/assets/photos/photo_6@25-01-2025_20-36-30.jpg"
    },
    {
        id: 63,
        text: "تدخل الجماعة الحيوية في المعدل مرتفع النمو فترة طويلة عندما تكون الأفراد:",
        options: ["أعلى من فترة الخصوبة الرئيسية", "أقل من فترة الخصوبة الرئيسية", "في متوسط فترة الخصوبة الرئيسية", "في نهاية فترة الخصوبة الرئيسية"],
        correctAnswer: "أعلى من فترة الخصوبة الرئيسية"
    },
    {
        id: 64,
        text: "معدل الولادات في آسيا 24 عدا الصين ومعدل الوفيات 8 في عام 2004م، ما معدل نمو الجماعة البشرية؟",
        options: ["%160", "%16", "%1.6", "%0.16"],
        correctAnswer: "%1.6"
    },
    {
        id: 65,
        text: "إذا احتوى حوض تربية أسماك على 80L من الماء واحتوى على 170 سمكة فما الكثافة التقريبية لجماعة السمك؟",
        options: ["4 سمكة / لتر", "3 سمكة / لتر", "2 سمكة / لتر", "1 سمكة / لتر"],
        correctAnswer: "2 سمكة / لتر"
    },
    {
        id: 66,
        text: "في الشكل أعلاه ما نمط نمو الجماعة المبين في الرسم؟",
        options: ["النمو النسبي", "النمو النسبي", "النمو الخطي", "طور التباطؤ"],
        correctAnswer: "النمو النسبي",
        imageURL: "/assets/photos/photo_7@25-01-2025_21-10-36.jpg"
    },
    {
        id: 67,
        text: "ماذا يمثل الخط الأفقي في الشكل أعلاه؟",
        options: ["القدرة الاستيعابية", "النمو الأسي", "النمو الهندسي", "النمو الخطي"],
        correctAnswer: "القدرة الاستيعابية",
        imageURL: "/assets/photos/photo_7@25-01-2025_21-10-36.jpg"
    },
    {
        id: 68,
        text: "في جورجيا وهي دولة في غرب آسيا كان معدل الولادات 11 في عام 2004م وكان معدل الوفيات 11 ما معدل نمو جماعة هذه الدولة في ذلك العام؟",
        options: ["0%", "0.11%", "1.1%", "11%"],
        correctAnswer: "0%"
    },
    {
        id: 69,
        text: "ما الذي يمثل القيمة غير المباشرة للتنوع الحيوي فيما يلي؟",
        options: ["الحماية من الفيضانات", "الملابس", "الأدوية", "الطعام"],
        correctAnswer: "الحماية من الفيضانات"
    },
    {
        id: 70,
        text: "ما المصطلح الذي يصف تجمعاً من المواقع التالية: غابة، بحيرة، ماء عذب، مصب النهر، المروج؟",
        options: ["الانقراض", "تنوع الأنواع", "تنوع النظام البيئي", "التنوع الوراثي"],
        correctAnswer: "تنوع النظام البيئي"
    },
    {
        id: 71,
        text: "يسمى عدد الأنواع المختلفة من المخلوقات الحية ونسبة تواجد كل نوع في المجتمع الحيوي؟",
        options: ["تنوع وراثي", "تنوع الأنواع", "الانقراض الجماعي", "تنوع النظام البيئي"],
        correctAnswer: "تنوع الأنواع"
    },
    {
        id: 72,
        text: "إذا كانت مياه البحر ملوثة تلوث نفطي، ما الخلوق الحي الذي إذا وضع في الماء أصبحت نظيفة؟",
        options: ["الزواحف", "الأسماك", "الطيور", "مخلوقات دقيقة (بكتيريا وفطريات)"],
        correctAnswer: "مخلوقات دقيقة (بكتيريا وفطريات)"
    },
    {
        id: 73,
        text: "في البحر الأحمر انتشرت نفايات عضوية سامة، أي المخلوقات الآتية أكثر ضرراً؟",
        options: ["الطيور المائية", "الحوت", "الإنسان", "الأسماك"],
        correctAnswer: "الأسماك"
    },
    {
        id: 74,
        text: "نقل شخص شجرة من نوع (X) لمكان آخر لتنقية الجو من التلوث، يسمى هذا:",
        options: ["زيادة حيوية", "افتراس", "توطين", "معالجة حيوية"],
        correctAnswer: "توطين"
    },
    {
        id: 75,
        text: "تسرب مياه الصرف الصحي يؤدي إلى:",
        options: ["زيادة الطحالب", "إثراء غذائي", "نقص الأكسجين", "النمو النسبي"],
        correctAnswer: "زيادة الطحالب"
    },
    {
        id: 76,
        text: "أي الأسباب التالية تؤدي إلى انقراض بعض أنواع الطيور؟",
        options: ["كثرة المفترسات", "كثرة الأمراض", "درجات الحرارة العالية", "تدمير الموطن البيئي"],
        correctAnswer: "تدمير الموطن البيئي"
    },
    {
        id: 77,
        text: "أُدخلت الأرنب البرية لقارة استراليا واستوطنت فيها، في ضوء التنوع الحيوي، ماذا يسمى هذا النوع؟",
        options: ["دخيل", "محلي", "منقرض", "مستوطن"],
        correctAnswer: "دخيل"
    },
    {
        id: 78,
        text: "يقوم الإنسان بالمحافظة على التنوع الحيوي بواسطة:",
        options: ["الاستخدام الجائر", "تدمير الموطن البيئي", "المحميات", "الأنواع الدخيلة"],
        correctAnswer: "المحميات"
    },
    {
        id: 79,
        text: "الألوان المختلفة لحنفساء الدعسوقة توضح شكلاً من:",
        options: ["تنوع الأنواع", "التنوع الوراثي", "تنوع النظام البيئي", "الانقراض الجماعي"],
        correctAnswer: "التنوع الوراثي"
    },
    {
        id: 80,
        text: "الطريقة المناسبة لتحليل النفط الذي يلوث المياه الجوفية هي:",
        options: ["الإثراء الغذائي", "النمو الأسي", "المعالجة الكيميائية", "المعالجة الحيوية"],
        correctAnswer: "المعالجة الكيميائية"
    },
    {
        id: 81,
        text: "تتكاثر غزلان بسبب انقراض بعض المفترسات قبل سنوات، وتوقع العلماء أن تبقى كما هي لعشر سنوات، فإن نموها:",
        options: ["يزداد", "يقل", "ثابت", "تدريجي"],
        correctAnswer: "ثابت"
    },
    {
        id: 82,
        text: "(بقرة - سنجاب - قرد - أسد - زرافة) يدل ذلك على تنوع:",
        options: ["وراثي", "الأنواع", "النظام البيئي", "الغلاف الحيوي"],
        correctAnswer: "النظام البيئي"
    },
    {
        id: 83,
        text: "استخدام البكتيريا وإنزيم لتخليص التربة من المخلفات النفطية في مدة لا تتجاوز 42 يوماً تسمى هذه العملية:",
        options: ["الاستغلال الجائر", "معالجة كيميائية", "زيادة حيوية", "معالجة حيوية"],
        correctAnswer: "معالجة حيوية"
    },
    {
        id: 84,
        text: "موت آخر فرد من نوع من المخلوقات الميتة هو:",
        options: ["النمو", "الانقراض", "التنوع الحيوي", "التوزيع العشوائي"],
        correctAnswer: "الانقراض"
    },
    {
        id: 85,
        text: "حيوان إذا غادر المجموعة أصبحت غير متزنة، فما هو؟",
        options: ["نسر", "ثعابين", "صفدع", "قرد"],
        correctAnswer: "ثعابين"
    },
    {
        id: 86,
        text: "تؤدي زيادة عدد الطحالب في البيئات إلى تهديد المخلوقات الحية، وذلك بسبب:",
        options: ["نقص الأكسجين", "زيادة الأكسجين", "نقص الأمونيا", "زيادة ثاني أكسيد الكربون"],
        correctAnswer: "نقص الأكسجين"
    },
    {
        id: 87,
        text: "انقراض نسبة عالية من الأنواع في فترة قصيرة؟",
        options: ["الاستغلال الجائر", "الانقراض التدريجي", "فقدان الموطن", "الانقراض الجماعي"],
        correctAnswer: "الانقراض الجماعي"
    },
    {
        id: 88,
        text: "زيادة تركيز المواد السامة في أجسام المخلوقات الحية كلما ارتفعت المستويات الغذائية في السلسلة الغذائية أو الشبكة الغذائية، يدل على:",
        options: ["الانقراض", "التضخم الحيوي", "الاستخدام المستدام", "المعالجة الحيوية"],
        correctAnswer: "التضخم الحيوي"
    },
    {
        id: 89,
        text: "من الشكل 1 اعلاه حدد الموطن البيئي الذي يدعم أكبر قدر من التنوع الحيوي طبيعياً؟",
        options: ["A", "B", "بالتساوي A,B", "لا شيء مما ذكر"],
        correctAnswer: "A",
        imageURL: "/assets/photos/photo_8@02-02-2025_21-39-05.jpg"
    },
    {
        id: 90,
        text: "من الشكل 1 اعلاه ... الموطن البيئي الذي له أكبر فاعلية نتيجة وجود الحد البيئي؟",
        options: ["A", "B", "A,B بالتساوي", "لا شيء مما ذكر"],
        correctAnswer: "B",
        imageURL: "/assets/photos/photo_8@02-02-2025_21-39-05.jpg"
    },
    {
        id: 91,
        text: "أي مما يلي لا يعد طريقة يفقد بها النوع موطنه البيئي؟",
        options: ["التدمير", "التلوث", "الاختلال", "الانقراض التدريجي"],
        correctAnswer: "الانقراض التدريجي"
    },
    {
        id: 92,
        text: "كم مرة يزيد الانقراض التدريجي الحالي على معدل الانقراض الطبيعي تقريباً؟",
        options: ["مرة واحدة", "10 مرات", "1000 مرة", "10000 مرة"],
        correctAnswer: "10 مرات"
    },
    {
        id: 93,
        text: "ما فائدة ممر الموطن البيئي؟",
        options: ["يزيد من أثر الحد البيئي في المنطقة", "نقل الأمراض من منطقة إلى أخرى", "نقل الطفيليات بسهولة من منطقة إلى أخرى", "انتقال أفراد الأنواع بأمان من منطقة إلى أخرى"],
        correctAnswer: "انتقال أفراد الأنواع بأمان من منطقة إلى أخرى"
    },
    {
        id: 94,
        text: "الكارثة التي يسببها الإنسان، وتحتاج إلى أطول زمن لإعادة استصلاحها هي",
        options: ["الاستغلال الجائر للمياه الجوفية", "التلوث الصناعي", "القنبلة النووية", "البقعة النفطية"],
        correctAnswer: "القنبلة النووية"
    },
    {
        id: 95,
        text: "ما الكارثة الطبيعية التي تحتاج إلى أقل زمن لإعادة استصلاحها؟",
        options: ["صاعقة برق", "سقوط نيازك", "انفجار بركاني", "تسونامي"],
        correctAnswer: "انفجار بركاني"
    },
    {
        id: 96,
        text: "في الشكل 2 اعلاه ما المصطلح الذي يصف الرقم (1) في المنحنى؟",
        options: ["الاستغلال الجائر للأنواع الحية", "تدمير الموطن البيئي", "الانقراض الجماعي", "الانقراض التدريجي"],
        correctAnswer: "الانقراض الجماعي",
        imageURL: "/assets/photos/photo_9@02-02-2025_22-07-14.jpg"
    },
    {
        id: 97,
        text: "في الشكل 2 اعلاه ترتبط قيمة المنحنى 2 بالانقراض الناتج",
        options: [
            "تدمير الموطن البيئي للحيوان الأصلي عندما استوطن الانسان الجزيرة",
            "زيادة الصناعات وتأثير الإنسان مع مرور الوقت",
            "إدخال حيوانات غير أصيلة إلى النظام البيئي في الجزيرة",
            "مرض قاتل أثر في الجماعات الحيوية",
        ],
        correctAnswer: "زيادة الصناعات وتأثير الإنسان مع مرور الوقت",
        imageURL: "/assets/photos/photo_9@02-02-2025_22-07-14.jpg"
    },
    {
        id: 98,
        text: "ما الظروف التي أدت إلى ظهور سلسلة من الأحداث على شاطىء ألاسكا ثم بدء اختفاء غابات عشب البحر ؟",
        options: ["نقصان كمية العوالق", "زيادة أعداد ثعالب الماء", "الصيد الزائد للحيتان الآكلة للعوالق", "التلوث الناتج من المبيدات"],
        correctAnswer: "نقصان كمية العوالق",
    },
    {
        id: 99,
        text: "أي أنواع السلوك يمثل الحركة الفصلية ؟",
        options: ["السلوك الإدراكي", "سلوك الهجرة", "السلوك المطبوع", "التعلم الكلاسيكي الشرطي"],
        correctAnswer: "سلوك الهجرة",
    },
    {
        id: 100,
        text: "قيام طائر الطاووس بفرد (نفش) ريشه الملون يعبر :",
        options: ["سلوك تنافس", "سلوك سيادة", "سلوك صراع", "سلوك مغازلة"],
        correctAnswer: "سلوك مغازلة",
    },
    {
        id: 101,
        text: "من خلال متابعتك لمجموعة من النمل ، كيف يسيرون في خطوط معينة؟",
        options: ["رائحة المادة", "سماع الصوت", "طعم المادة", "الإبصار"],
        correctAnswer: "رائحة المادة",
    },
    {
        id: 102,
        text: "إذا كان هناك بقرة كلما ذهبت إلى الجدار الأحمر يقوم الرعاة بإعطائها ولدها ، فما نوع هذا السلوك ؟",
        options: ["الإيثار", "الكلاسيكي الشرطي", "المغازلة", "الاجرائي الشرطي"],
        correctAnswer: "الكلاسيكي الشرطي",
    },
    {
        id: 103,
        text: "ما السلوك الذي يهتم بالحصول على الطعام والتغذي عليه ؟",
        options: ["الحضانة", "جمع الطعام", "الإيثار", "المغازلة"],
        correctAnswer: "جمع الطعام",
    },
    {
        id: 104,
        text: "غراب يكسر بيضة للتغذي عليها ، هذا السلوك هو :",
        options: ["إدراكي", "شرطي", "غريزي", "مطبوع"],
        correctAnswer: "غريزي",
    },
    {
        id: 105,
        text: "مشي صغار البط خلف أمهم ، ما نوع هذا السلوك ؟",
        options: ["سلوك مكتسب", "إيثار", "نمط ثايت", "إجرائي شرطي"],
        correctAnswer: "نمط ثايت",
    },
    {
        id: 106,
        text: "لمس طفل شيئاً ساخناً ، ثم تعلم عدم لمسه مرة أخرى ، هذا مثال على :",
        options: ["السلوك الإدراكي", "التعلم الإجرائي الشرطي", "التعود", "التعلم الكلاسيكي الشرطي"],
        correctAnswer: "التعلم الكلاسيكي الشرطي",
    },
    {
        id: 107,
        text: "يسمى القتال الذي يحدث بين مخلوقين من النوع نفسه :",
        options: ["إيثار", "تعود", "مغازلة", "صراع"],
        correctAnswer: "صراع",
    },
    {
        id: 108,
        text: "نادت نملة ... قال تعالى ( ياأيها النمل ادخاوا مساكنكم لا يحطمنكم سليمان وجنوده وهم لا يشعرون ) .. أي أنواع السلوك ؟",
        options: ["تواصل", "حضانة", "سيادة", "جمع الطعام"],
        correctAnswer: "تواصل",
    },
    {
        id: 109,
        text: "استعمال القرد للحجر عند كسر الثمار يعد سلوك :",
        options: ["إجرائي شرطي", "غريزي", "كلاسيكي شرطي", "إدراكي"],
        correctAnswer: "إدراكي",
    },
    {
        id: 110,
        text: "السلوك الذي يعتمد على الوراثة وليس التجارب هو سلوك :",
        options: ["الكلاسيكي الشرطي", "الغريزي", "المكتسب", "الإدراكي"],
        correctAnswer: "الغريزي",
    },
    {
        id: 111,
        text: "يعيش عدد من الأفراد معاً ويضحي أحدهم من أجل الآخرين ، ما نوع هذا السلوك ؟",
        options: ["الإيثار", "المغازلة", "الحضانة", "جمع الطعام"],
        correctAnswer: "الإيثار",
    },
    {
        id: 112,
        text: "سلوك يعتمد على الوراثة (أي لا يعتمد على التجارب السابقة)",
        options: ["إدراكي", "مكتسب", "غريزي", "متعلم"],
        correctAnswer: "غريزي",
    },
    {
        id: 113,
        text: "كل الصفات التالية تنطبق على الفرمونات عدا :",
        options: ["مواد كيميائية", "تستطيع المفترسات شمها", "تتواصل بها أفراد الجماعة", "لا تستطيع المفترسات شمها"],
        correctAnswer: "لا تستطيع المفترسات شمها",
    },
    {
        id: 114,
        text: "عند هروب الغراب عند رؤيته للفزاعة يعد مثال على سلوك :",
        options: ["المطبوع", "التعود", "الإدراكي", "الاجرائي الشرطي"],
        correctAnswer: "التعود",
    },
    {
        id: 115,
        text: "ترتيب القرود من الأقوى إلى الأضعف وتقليل العداوة بينهم ، يعتبر هذا سلوك :",
        options: ["مغازلة", "صراع", "نمط يومي", "سيادة"],
        correctAnswer: "سيادة",
    },
    {
        id: 116,
        text: "تستعمل الفرمونات لـ :",
        options: ["التواصل", "الصراع", "الهجرة", "الحضانة"],
        correctAnswer: "التواصل",
    },
    {
        id: 117,
        text: "قيام بعض حيوانات السيرك بتقديم العروض للحصول على الحلوى ، يعتبر هذا سلوك :",
        options: ["كلاسيكي شرطي", "تعود", "إجرائي شرطي", "إدراكي"],
        correctAnswer: "إجرائي شرطي",
    },
    {
        id: 118,
        text: "عند نقل أسد من غابة إلى حديقة الحيونات ، أي سلوك يبقى معه ؟",
        options: ["إيجاد شريك التزاوج", "الحضانة", "الافتراس", "النفوذ"],
        correctAnswer: "الافتراس",
    },
    {
        id: 119,
        text: "الضفدع يصدر صوت نقيق تميزه الإناث ، هذا السلوك يعتبر :",
        options: ["تعود", "غريزي", "إدراكي", "مكتسب"],
        correctAnswer: "غريزي",
    },
    {
        id: 120,
        text: "السلوك الذي يرتبط مباشرة مع نجاح عملية التكاثر داخل أفراد النوع هو :",
        options: ["الحضانة", "التضحية بالنفس", "الإيثار", "المغازلة"],
        correctAnswer: "المغازلة",
    },
    {
        id: 121,
        text: "تعيش أفراد من الحيوانات في مستعمرات كل فرد يؤدي وظيفة محددة ويقوم بعمل يفيد فرد آخر على حساب حياته ، هذا السلوك يعني:",
        options: ["إيثار", "حضانة", "تواصل", "نفوذ"],
        correctAnswer: "إيثار",
    },
    {
        id: 122,
        text: "أي مما يلي مثال على السلوك المطبوع ؟",
        options: [
            "صغير عصفور تعود على رؤية الأجسام فوقه",
            "جرد يتعلم الضغط على مقبض للحصول على الغذاء",
            "صغير أسد يتعلم كيف يصداد",
            "عودة سمك السلمون إلى المياه التي فقس فيها ليتكاثر",
        ],
        correctAnswer: "عودة سمك السلمون إلى المياه التي فقس فيها ليتكاثر",
    },
    {
        id: 123,
        text: "أي أنواع السلوك الذي يجعل الحيوان ينهمك في حل المشكلات ؟",
        options: ["نمط الأداء الثابت", "السلوك المطبوع", "السلوك الادراكي", "التعلم الشرطي"],
        correctAnswer: "السلوك الادراكي",
    },
    {
        id: 124,
        text: "في أي الفترات يتكون السلوك المطبوع للحيوان ؟",
        options: ["الفترة الحساسة", "فترة الحضانة", "فترة التعلم", "فترة الإدراك"],
        correctAnswer: "الفترة الحساسة",
    },
    {
        id: 125,
        text: "أي مما يلي مثال على النمط اليومي ؟",
        options: ["البيات الشتوي", "دورة التكاثر", "الهجرة", "النوم والاستيقاظ"],
        correctAnswer: "النوم والاستيقاظ",
    },
    {
        id: 126,
        text: "عند مشاهدة مجموعة من الطيور واقفة على ثمثال فزاعة الطيور فإن الوصف الحقيقي لهذا السلوك هو :",
        options: ["التعود", "المطبوع", "نمط الأداء الثابت", "التعلم الإجرائي الشرطي"],
        correctAnswer: "التعود",
    },
    {
        id: 127,
        text: "ضمان حصول الأبناء على فرصة كبيرة للعيش مثال على سلوك :",
        options: ["الصراع", "الهجرة", "الحضانة", "تحديد منطقة النفوذ"],
        correctAnswer: "الحضانة",
    },
    {
        id: 128,
        text: "في الشكل 1 أي الأرقام التالية على المحللات ؟",
        options: ["1", "2", "3", "4"],
        correctAnswer: "4",
        imageURL: "/assets/photos/photo_10@03-02-2025_00-23-02.jpg",
    },
    {
        id: 129,
        text: "في الشكل 2 اعلاه هرم غذائي افتراضي ، استنتج ماذا يحدث للمخلوقات الحية ؟",
        options: ["لا تتأثر المخلوقات الحية", "تزداد المخلوقات الحية", "تموت المخلوقات الحية", "لا شيء مما سبق"],
        correctAnswer: "تزداد المخلوقات الحية",
        imageURL: "/assets/photos/photo_11@03-02-2025_00-32-06.jpg",
    },
    {
        id: 130,
        text: "في الشكل 3 اعلاه يصف تحمل أحد المخلوقات الحية (السلمون) يمثل الحرف (D) منطقة :",
        options: ["عدم التحمل", "الإجهاد الفسيولوجي", "المنطقة المثلى", "مدى التحمل"],
        correctAnswer: "الإجهاد الفسيولوجي",
        imageURL: "/assets/photos/photo_12@03-02-2025_00-36-19.jpg",
    },
    {
        id: 131,
        text: "يمثل الشكل 4 اعلاه ؟",
        options: ["هرم الطافة", "سلسلة غذائية", "هرم بيئي", "شبكة غذائية"],
        correctAnswer: "سلسلة غذائية",
        imageURL: "/assets/photos/photo_13@03-02-2025_00-41-44.jpg",
    },
    {
        id: 132,
        text: "في الشكل 5 اعلاه أي أجزاء الشبكة الغذائية يحوي أكبر كتلة حيوية",
        options: ["النباتات الخضراء", "الثعالب", "الفئران", "الأرنب"],
        correctAnswer: "النباتات الخضراء",
        imageURL: "/assets/photos/photo_14@03-02-2025_00-44-36.jpg",
    },
    {
        id: 133,
        text: "في الشكل 6 اعلاه أي منطقة تتعرض لأقل كمية من أشعة الشمس في وحدة المساحة :",
        options: [
            "شمال المنطقة المعتدلة وجنوبها",
            "شمال وجنوب دائرة العرض 30",
            "بين مداري الجدي والسرطان",
            "شمال وجنوب دائرة العرض 60",
        ],
        correctAnswer: "شمال وجنوب دائرة العرض 30",
        imageURL: "/assets/photos/photo_15@03-02-2025_00-49-21.jpg",
    },
    {
        id: 134,
        text: "احدى الطرق التالية ليست من الطرق التي استعملها علماء البيئة لدراسة العلاقات المتبادلة بين المخلوقات الحية ...",
        options: ["التواصل", "إجراء التجارب", "الملاحظات", "تصميم النماذج"],
        correctAnswer: "التواصل",
    },
    {
        id: 135,
        text: "حدد أي مما يلي يشكل جماعة حيوي. ؟",
        options: [
            "كل الأرانب البيضاء التي تعيش على الأرض",
            "كل الأرانب بيضاء الذيل التي تعيش في المنطقة ١ اليوم",
            "كل الأرانب بيضاء الذيل التي عاشت في المنطقة ١ قديما",
            "كل الأرانب بيضاء الذيل",
        ],
        correctAnswer: "كل الأرانب بيضاء الذيل التي تعيش في المنطقة ١ اليوم",
    },
    {
        id: 136,
        text: "ما نوع المخلوق الحي غير ذاتي التغذية الذي يستهلك النباتات فقط للحصول على الطاقة ؟",
        options: ["منتجات", "ٱكلات الاعشاب", "ٱكلات اللحوم", "القارتة"],
        correctAnswer: "ٱكلات الاعشاب",
    },
    {
        id: 137,
        text: "أي المخلوقات الحية التالية توفر المواد المغذية للاستخدام في النظام البيئي ؟",
        options: ["المنتجات", "الكانسة", "ٱكلات الاعشاب", "ٱكلات اللحوم"],
        correctAnswer: "المنتجات",
    },
    {
        id: 138,
        text: "إحدى العمليات التالية ليست من العمليات التي تكون الدورة الجيوكيميائية الحيوية ..",
        options: ["العمليات الحيوية", "العمليات الفيزيائية", "العمليات الكيميائية", "العمليات الجيولوجية"],
        correctAnswer: "العمليات الجيولوجية",
    },
    {
        id: 139,
        text: "كيف يتم الحصول على النيتروجين الجوي ؟",
        options: ["الفطريات المثبتة للنيتروجين", "البكتيريا المثبتة للنيتروجين", "النباتات", "الأسمدة"],
        correctAnswer: "البكتيريا المثبتة للنيتروجين",
    },
    {
        id: 140,
        text: "إحدى الطرق التالية ليست من الطرق التي يضاف لها الفوسفات إلى الماء ؟",
        options: ["الصخور", "المعادن", "المحللات", "البرق"],
        correctAnswer: "البرق",
    },
    {
        id: 141,
        text: "افترض أن أحد الفطريات قتل نوعا من الشجر في مجتمع الغابة ، ما الذي يمكن حدوثه لأنواع نقار الخشب التي تعيش على ذلك النوع من الشجر ؟",
        options: [
            "تزيد أعداد أفراد الجماعة الحيوية لنقار الخشب",
            "تنخفض أعداد أفراد الجماعة الحيوية لنقار الخشب",
            "لا تتأثر أعداد الجماعة الحيوية لنقار الخشب",
            "ينقرض نقار الخشب من الغلاف الجوي",
        ],
        correctAnswer: "تنخفض أعداد أفراد الجماعة الحيوية لنقار الخشب",
    },
    {
        id: 142,
        text: "منطقة من النهر تترسب بها معظم الرسوبيات ...",
        options: ["المصب", "منطقة الميل الحاد", "منطقة جريان الماء السريع", "منبع النهر"],
        correctAnswer: "المصب",
    },
    {
        id: 143,
        text: "ما العامل المحدد في البحيرات قليلة التغذي ؟",
        options: ["توفر الضوء", "توفر الأكسجين", "توفر الغذاء", "توفر العمق"],
        correctAnswer: "توفر الغذاء",
    },
    {
        id: 144,
        text: "لماذا تتوقع وجود عوالق قليلة في المنطقة العميقة ؟",
        options: ["لكثرة ٱكلات العوالق", "لقلة الضوء", "لقلة الأكسجين", "لارتفاع درجة الحرارة"],
        correctAnswer: "لقلة الضوء",
    },
    {
        id: 145,
        text: "إحدى التأثيرات التالية ليست من التأثيرات المهمة للأنظمة البيئية البحرية المائية في كوكب الأرض ...",
        options: ["التخلص من ثاني أكسيد الكربون", "التزويد بالأكسجين", "مصدر لمعظم أشكال الهطول", "التزويد بالنتروجين"],
        correctAnswer: "التزويد بالنتروجين",
    },
    {
        id: 146,
        text: "قسم من منطقة المد والجزر لا يغمرها المد ..",
        options: ["منطقة الرذاذ", "منطقة المد المرتفع", "منطقة المد المتوسط", "منطقة المد المنخفض"],
        correctAnswer: "منطقة الرذاذ",
    },
    {
        id: 147,
        text: "حدد عاملين محددين كلما ازداد العمق في منطقة قاع المحيط ؟",
        options: ["الأكسجين والكربون", "الضوء والحرارة", "الملوحة والحموصة", "النيتروجين والفسفور"],
        correctAnswer: "الضوء والحرارة",
    },
    {
        id: 148,
        text: "يتوزع حيوان ٱكل لحوم ضمن نطاق منطقة حيث يسيطر كل فرد على مساحة 300 كيلو متر مربع ، ما نوع التوزيع في جماعة هذا الحيوان ؟",
        options: ["تكتلي", "قطعان", "عشوائي", "منتظم"],
        correctAnswer: "منتظم",
    },
    {
        id: 149,
        text: "أي مما يلي يعد مثالا على العوامل التي تعتمد على الكثافة ؟",
        options: [
            "صقيع دمر محصول الطماطم",
            "تلوث الماء في نهر الامازون",
            "فطريات تنتقل من نبات إلى ٱخر",
            "فيضان في امريكا الشماليه",
        ],
        correctAnswer: "فطريات تنتقل من نبات إلى ٱخر",
    },
    {
        id: 150,
        text: "معدل الوفيات والمواليد ومعدلات الهجرة الداخلية والخارجية تؤثر في ....",
        options: ["توزيع الجماعة", "معدل نمو الجماعة", "نطاق الجماعة", "موطن الجماعة"],
        correctAnswer: "معدل نمو الجماعة",
    },
    {
        id: 151,
        text: "من الأحداث التي قد تغير اتجاه نمو الجماعة البشرية ؟",
        options: ["الجفاف والتغيرات المناخية", "الفيضانات والأعاصير", "الامراض والحروب", "التلوث والتضخم الحيوي"],
        correctAnswer: "الامراض والحروب",
    },
    {
        id: 152,
        text: "من العواقب المحتملة للنمو السكاني السريع ...",
        options: ["التلوث", "الإثراء الغذائي", "انتشار الأمراض والمجاعات", "الأعاصير والفيضانات"],
        correctAnswer: "انتشار الأمراض والمجاعات",
    },
    {
        id: 153,
        text: "حدث يتم عندما ينقرض عدد كبير من المخلوقات الحية في فترة زمنية قصيرة يسمى ..",
        options: ["الانقراض التدريجي", "الانقراض الطبيعي", "الانقراض الجماعي", "الانقراض السريع"],
        correctAnswer: "الانقراض الجماعي",
    },
    {
        id: 154,
        text: "ما سبب انقراض النمر العربي ؟",
        options: ["التلوث", "صيد فرائسه", "تغير المناخ", "فقدان الموطن البيئي"],
        correctAnswer: "فقدان الموطن البيئي",
    },
    {
        id: 155,
        text: "سلسلة غذائية حسب الترتيب التالي ... <br>ماء . منتجات . عوالق حيوانية . سمك صغير . سمك كبير . طيور تأكل السمك .<br>يكون أعلى تركيز للمواد السامة في السلسلة السابقة هو",
        options: ["عوالق حيوانية", "سمك كبير", "سمك صغير", "طيور تأكل السمك"],
        correctAnswer: "طيور تأكل السمك",
    },
    {
        id: 156,
        text: "ما المخلوق الحي الذي يتأثر أكثر من غيره بالتضخم الحيوي ؟",
        options: ["الحشائش", "البذور", "الحمام", "الصقر"],
        correctAnswer: "الصقر",
    },
    {
        id: 157,
        text: "أي موارد الطاقة التالية غير متجددة ؟",
        options: ["الرياح", "الغاز", "الشمس", "الماء"],
        correctAnswer: "الغاز",
    },
    {
        id: 158,
        text: "يستطيع الإنسان استخدام الموارد بشكل يحقق التنمية المستدامة لها ؟",
        options: ["حفظ الاستهلاك و تدوير المواد", "زيادة الإنتاج والتنقيب", "تطوير التقنية الحديثة", "زيادة الأنواع الدخيلة"],
        correctAnswer: "حفظ الاستهلاك و تدوير المواد",
    },
    {
        id: 159,
        text: "إحدى الطرق التالية تسرع من عملية إعادة استصلاح الأنظمة البيئية المتضررة ؟",
        options: ["الإثراء الغذائي", "التضخم الحيوي", "الزيادة الحيوية", "الاستيطان"],
        correctAnswer: "الزيادة الحيوية",
    },
    {
        id: 160,
        text: "هدف قانون الانواع المهددة بالانقراض ... يعطي الحماية القانونية للأنواع ...",
        options: ["المنقرضة", "المهددة بالانقراض", "الطبيعية", "الدخيلة"],
        correctAnswer: "المهددة بالانقراض",
    },
    {
        id: 161,
        text: "العاملين الرئيسين اللذين يؤثران في سلوك الحيوانات..",
        options: ["الوراثة والخبرات السابقة", "التعود والانطلاع", "التعلم الكلاسيكي والاجرائي", "المغازلة والحضانة"],
        correctAnswer: "الوراثة والخبرات السابقة",
    },
    {
        id: 162,
        text: "عندما تقوم الإوز بدحرجة البيضة إلى العش ... هي تمارس سلوك ...",
        options: ["التعود", "نمط الأداء الثابت", "النمط اليومي", "السلوك المطبوع"],
        correctAnswer: "نمط الأداء الثابت",
    },
    {
        id: 163,
        text: "الهدف من السلوكات التنافسية ...",
        options: ["تقديم الفائدة لأفراد ٱخرين", "السيطرة على المصادر", "التعود", "زيادة فرص البقاء للجماعة"],
        correctAnswer: "السيطرة على المصادر",
    },
    {
        id: 164,
        text: "عند تغير درجات الحرارة أو قلة الأمطار تلجأ بعض الطيور والثدييات ٱكلات الاعشاب إلى سلوك ...",
        options: ["الايثار", "الهجرة", "جمع الطعام", "نمط الأداء الثابت"],
        correctAnswer: "الهجرة",
    },
    {
        id: 165,
        text: "إحدى السلوكات التالية ليس لها علاقة بجذب شريك التزاوج ...",
        options: ["المغازلة", "الفرمونات", "التواصل السمعي", "التعود"],
        correctAnswer: "التعود",
    },
    {
        id: 166,
        text: "ما نوع السلوك الخاص بالعناية بالصغار ؟",
        options: ["سلوك غريزي", "سلوك مكتسب", "سلوك تواصل", "سلوك تعلم"],
        correctAnswer: "سلوك غريزي",
    },
    {
        id: 167,
        text: "من إيجابيات سلوك جمع الطعام ...",
        options: ["زيادة فرص البقاء", "لا تنتبه له المفترسات", "يحفظ جينات الآباء", "تجنب المفترسات"],
        correctAnswer: "زيادة فرص البقاء",
    },
    {
        id: 168,
        text: "من سلبيات الاتصال بالفرمونات ...",
        options: ["يحتاج كمية كبيرة من الطاقة", "مداها محدود", "استهلاك كمية كبيرة من كافة الأبوين", "استخدام الطاقة"],
        correctAnswer: "مداها محدود",
    },
    {
        id: 169,
        text: "أي مما يلي يعد مثالا على سلوك التعود ؟",
        options: [
            "مطاردة الصقر للفأر",
            "استجابة صغار الطيور لأمها عندما تحط على العش",
            "هروب الفأر من الصقر",
            "توقف استجابة صغار الطيور لتساقط أوراق الأشجار",
        ],
        correctAnswer: "توقف استجابة صغار الطيور لتساقط أوراق الأشجار",
    },
    {
        id: 170,
        text: "أي مما يلي يعد مثالا على التعلم الاجرائي الشرطي ؟",
        options: [
            "أفرز الكلب اللعاب عند سماع صوت الجرس",
            "تعود حصان على ضجة الشارع",
            "صغير يكون ارتباط مع أول حيوان يراه بعد الولادة",
            "جرذ تعلم أنه يستطيع الحصول على الغذاء بسحب مقبض",
        ],
        correctAnswer: "جرذ تعلم أنه يستطيع الحصول على الغذاء بسحب مقبض",
    },
    {
        id: 171,
        text: "أي مما يأتي يعد سلوك إدراكي ؟",
        options: ["عمل طقوس التزاوج", "خداع حيوان ٱخر", "التطبع على شيء ماء", "البحث عن مصادر الغذاء"],
        correctAnswer: "خداع حيوان ٱخر",
    },
    {
        id: 172,
        text: "أي مما يلي لا يرتبط بسلوك تحديد منطقة النفوذ ؟",
        options: ["القتال والضرب", "تعليم الصغار الصيد", "صراخ السناجب", "الإشارات الكيميائية"],
        correctAnswer: "تعليم الصغار الصيد",
    },
    {
        id: 173,
        text: "أي مما يلي لا يعد من العوامل التي تؤثر في الدورات الحيوية ؟",
        options: ["توفر الغذاء", "تغير درجات الحرارة", "تناقص ساعات النهار", "معدل نمو الجسم"],
        correctAnswer: "معدل نمو الجسم",
    },
    {
        id: 174,
        text: "أي مما يلي يعد مثالا على التنوع الوراثي في غابة مطيرة ؟",
        options: [
            "بقع متنوعة في فراء نمر مرقط",
            "الجينات داخل النظام البيئي",
            "تنوع واسع الأنواع الخنافس",
            "ال DNA لأحد أفراد القرد الكسلان",
        ],
        correctAnswer: "تنوع واسع الأنواع الخنافس",
    },
    {
        id: 175,
        text: "أي مما يلي يزيد من فرص بقاء بعض الأنواع في حالات تغير الظروف المناخية أو تفشي الأمراض ؟",
        options: ["التهجين الداخلي", "تجزئة الموطن البيئي", "التنافس", "الاستغلال الجائر"],
        correctAnswer: "التهجين الداخلي",
    },
    {
        id: 176,
        text: "ترجع فكرة ضرورة الإبقاء على الغابات كطبيعة خلابة إلى ...",
        options: ["القيمة الطبية", "القيمة الجمالية", "القيمة العلمية", "القيمة الاقتصادية"],
        correctAnswer: "القيمة الجمالية",
    },
    {
        id: 177,
        text: "جميع ما يلي يعد من العوامل التي تجعل الأنواع التي تعيش في الجزر عرضة للانقراض ما عدا ...",
        options: [
            "صغر حجم أفراد الجماعة الحيوية",
            "تعرضها لحيوانات مفترسة دخيلة",
            "الانتشار الواسع للجماعة الحيوية",
            "ضعف مقاومتها للأمراض الجديدة",
        ],
        correctAnswer: "الانتشار الواسع للجماعة الحيوية",
    },
    {
        id: 178,
        text: "جميع ما يلي من الحيوانات المهددة بالانقراض في المملكة العربية السعودية بسبب الاستغلال الجائر ما عدا ...",
        options: ["الوعل", "النمر العربي", "العفري", "الشاهين"],
        correctAnswer: "الشاهين",
    },
    {
        id: 179,
        text: "أي مما يلي يعد مثالا على تجزئة الموطن البيئي ؟",
        options: [
            "قطع جزء كامل من الغابة",
            "بناء عدة طرق عبر الأرض الرطبة",
            "إزالة المفترسات من غابة مطيرة",
            "إلقاء ملوثات كيميائية في بحيرة",
        ],
        correctAnswer: "بناء عدة طرق عبر الأرض الرطبة",
    },
    {
        id: 180,
        text: "أي مما يلي لا يعد من أسباب تدمير النظام البيئي ؟",
        options: ["إزالة الغطاء النباتي", "إنشاء ممرات حيوية", "عمليات التعدين", "تسرب النفط والمواد السامة"],
        correctAnswer: "إنشاء ممرات حيوية",
    },
    {
        id: 181,
        text: "أي المناطق التالية تعبر عن منطقة الإجهاد الفسيولوجي لجماعة حيوية ؟",
        options: [
            "منطقة بها عدد كبير من المخلوقات الحية للجماعة",
            "منطقة يزداد بها عدد المخلوقات الحية للجماعة",
            "منطقة ينعدم فيها وجود المخلوقات الحية للجماعة",
            "منطقة بها عدد قليل من المخلوقات الحية للجماعة",
        ],
        correctAnswer: "منطقة بها عدد قليل من المخلوقات الحية للجماعة",
    },
    {
        id: 182,
        text: "عندما يستبدل مجتمع حيوي بآخر نتيجة التغير في العوامل الحيوية واللاحيوية يسمى ...",
        options: ["تعاقب بيئي", "تصحر", "انقراض", "منطقة ساخنة"],
        correctAnswer: "تعاقب بيئي",
    },
    {
        id: 183,
        text: "أي التكيفات التي تساعد النبات على العيش في منطقة التندرا الحيوية ؟",
        options: [
            "أوراق تخزن المياه",
            "أوراق متساقطة في الشتاء",
            "جذور تنمو لعمق لا يتجاوز سنتمترات قليلة",
            "سيقان تحت أرضية لحمايتها من الحيوانات الرعوية",
        ],
        correctAnswer: "جذور تنمو لعمق لا يتجاوز سنتمترات قليلة",
    },
    {
        id: 184,
        text: "أي الخصائص التالية لا تنطبق على منطقة الصحراء ؟",
        options: [
            "سقوط المطر فيها فصلي (موسمي)",
            "من نباتاتها الصبار والطلح والنباتات العصارية",
            "توجد في جميع القارات ما عدا أوروبا",
            "معدل التبخر أعلى من معدل الهطل",
        ],
        correctAnswer: "توجد في جميع القارات ما عدا أوروبا",
    },
    {
        id: 185,
        text: "أي مما يلي يعد خاصية لمنطقة السافانا ؟",
        options: ["مناطق غابة كثيفة", "حشائش وأشجار متفرقة", "طبقة من التربة المتجمدة", "رمل وارض صخرية"],
        correctAnswer: "حشائش وأشجار متفرقة",
    },
    {
        id: 186,
        text: "أي المناطق الحيوية البرية التالية تحوي أكبر تنوع حيوي ؟",
        options: ["المصبات", "الشعاب المرجانية", "الغابات الاستوائية المطيرة", "البحيرات حقيقية التغذي"],
        correctAnswer: "الغابات الاستوائية المطيرة",
    },
    {
        id: 187,
        text: "أي مما يلي يفسر لماذا تعيش أنواع أقل من الحيوانات في النهر سريع الجريان ؟",
        options: [
          "تمنع التيارات تراكم معظم المادة العضوية",
          "يخفض الماء البارد مستويات الأكسجين الذائب",
          "تكيفت حيوانات قليلة لمقاومة الماء عالي السرعة",
          "يعكس الماء السطحي أشعة الشمس بعيدا عن المخلوقات ذاتية التغذي",
        ],
        correctAnswer: "تمنع التيارات تراكم معظم المادة العضوية",
      },
      {
        id: 188,
        text: "ما أهمية الأنواع الرائدة في التعاقب البيئي ؟",
        options: [
          "تكوين التربة",
          "زيادة التنوع الحيوي",
          "تحسين جودة الهواء",
          "زيادة كمية المياه الجوفية",
        ],
        correctAnswer: "تكوين التربة",
      },
      {
        id: 189,
        text: "لماذا تتوقع وجود عوالق نباتية قليلة في المنطقة العميقة ؟",
        options: [
          "لقلة الضوء الذي يصل إليها",
          "لقلة الأكسجين",
          "لارتفاع درجة الحرارة",
          "لكثرة المفترسات",
        ],
        correctAnswer: "لقلة الضوء الذي يصل إليها",
      },
      {
        id: 190,
        text: "ما القسم الذي لا يغمره الماء من أقسام منطقة المد والجزر ؟",
        options: [
          "منطقة الرذاذ",
          "منطقة المد المرتفع",
          "منطقة المد المتوسط",
          "منطقة المد المنخفض",
        ],
        correctAnswer: "منطقة الرذاذ",
      },
      {
        id: 191,
        text: "اذكر العوامل المؤثرة في معدل نمو الجماعة ؟",
        options: [
          "معدل المواليد و معدل الوفيات",
          "معدل الهجرة الداخلية والخارجية",
          "توفر الغذاء والماء",
          "التغيرات المناخية",
        ],
        correctAnswer: "معدل المواليد و معدل الوفيات",
      },
      {
        id: 192,
        text: "حدد العاملين الرئيسيين اللذين يؤثران في سلوك الحيوانات ؟",
        options: [
          "الوراثة والخبرات السابقة",
          "التغيرات المناخية",
          "توفر الغذاء والماء",
          "التفاعل مع الحيوانات الأخرى",
        ],
        correctAnswer: "الوراثة والخبرات السابقة",
      },
      {
        id: 193,
        text: "ما العوامل التي توجد في النظام البيئي ولا توجد في المجتمع الحيوي ؟",
        options: [
          "العوامل اللاحيوية",
          "التفاعلات بين الكائنات الحية",
          "التنوع الحيوي",
          "الموارد الطبيعية",
        ],
        correctAnswer: "العوامل اللاحيوية",
      },
      {
        id: 194,
        text: "ما سبب تجانس مياة البركة من حيث توزيع الأكسجين والغذاء على طبقاتها في فصلي الربيع والخريف ؟",
        options: [
          "حركة الرياح",
          "زيادة درجة الحرارة",
          "زيادة كمية الأمطار",
          "زيادة كمية الضوء",
        ],
        correctAnswer: "حركة الرياح",
      },
      {
        id: 195,
        text: "كيف يمكن الحصول على النيتروجين من الغلاف الجوي ؟",
        options: [
          "بواسطة البكتيريا المثبتة للنيتروجين",
          "عن طريق الأمطار",
          "عن طريق النباتات",
          "عن طريق الحيوانات",
        ],
        correctAnswer: "بواسطة البكتيريا المثبتة للنيتروجين",
      },
      {
        id: 196,
        text: "ما العوامل التي تقل كلما زاد العمق في منطقة قاع المحيط ؟",
        options: [
          "الضوء و الحرارة",
          "الملوحة و الأكسجين",
          "الضغط و الملوحة",
          "الضوء و الضغط",
        ],
        correctAnswer: "الضوء و الحرارة",
      },
      {
        id: 197,
        text: "ما الأحداث التي قد تغير اتجاه نمو الجماعة البشرية ؟",
        options: [
          "الامراض والحروب",
          "التغيرات المناخية",
          "الهجرة الداخلية والخارجية",
          "زيادة الموارد الطبيعية",
        ],
        correctAnswer: "الامراض والحروب",
      },
      {
        id: 198,
        text: "ما الذي يحقق التنمية المستدامة للموارد ؟",
        options: [
          "خفض الاستهلاك و إعادة تدوير المواد",
          "زيادة الإنتاج والتنقيب",
          "تطوير التقنية الحديثة",
          "زيادة الأنواع الدخيلة",
        ],
        correctAnswer: "خفض الاستهلاك و إعادة تدوير المواد",
      },
      {
        id: 199,
        text: "الطرق التي تسرع من عملية استصلاح الأنظمة البيئية المتضررة ؟",
        options: [
          "الزيادة الحيوية والمعالجة الحيوية",
          "الإثراء الغذائي",
          "التضخم الحيوي",
          "الاستيطان",
        ],
        correctAnswer: "الزيادة الحيوية والمعالجة الحيوية",
      },
      {
        id: 200,
        text: "الهدف من السلوكات التنافسية ؟",
        options: [
          "السيطرة على المصادر",
          "زيادة فرص البقاء",
          "التواصل مع الآخرين",
          "زيادة التنوع الحيوي",
        ],
        correctAnswer: "السيطرة على المصادر",
      },
]